Revit.GeometryConversion.ProtoToRevitMesh.AddFace(Autodesk.Revit.DB.TessellatedShapeBuilder,Autodesk.DesignScript.Geometry.IndexGroup,Autodesk.DesignScript.Geometry.Point[],System.Boolean,Autodesk.Revit.DB.ElementId)
this method converts a ProtoGeometry IndexGroup and Points to a Revit tessellated face, and adds it
to the TessellatedShape Builder that is passed in.
tsb: a Revit TessellatedShapeBuilder which we wish to add a face to
f:  a ProtoGeometry indexGroup defining a Mesh face
meshVerts: a vertex array of Points which should be the
entire vertex array extracted from a ProtoGeometry Mesh.
performHostUnitConversion: a Bool which enables host unit conversion scaling
materialId: an ElementId represnting the Material we want to apply to this face